/*
********************************************************************************
文件名	：lcd_drv.c
文件描述：LCD驱动，128*64 COG, 2种液晶驱动控制器：ST7565R-573->机型1 \ UC1701X-091->机型2，
		  注意兼容局限性：机型1/2对应液晶型号不能互换，互换后对比度就不合适了
建立人	：杨瑞军
建立日期：2016.12.15
修改内容：
修改人	：
修改日期：
********************************************************************************
*/

#define __LCD_DRV_GLOBAL
#include "lcd_if.h" 
#include "lcd_drv.h"    
#include "public.h"             


/*
********************************************************************************
函数名称：lcd_drv_init
函数描述：
参数描述：
返回值	：
********************************************************************************
*/
void lcd_drv_init(void) 
{
	lcd_if_init();
	lcd_init();
}

/*
********************************************************************************
函数名称：lcd_init
函数描述：lcd初始化
参数描述：
返回值	：
********************************************************************************
*/
void lcd_init(void)
{
	lcd_reset();
	
	lcd_wr_cmd(0xe2);	//软复位
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	lcd_wr_cmd(0x2c);  //升压步聚1
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();	
	lcd_wr_cmd(0x2e);  //升压步聚2
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	lcd_wr_cmd(0x2f);  //升压步聚3
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	lcd_wr_cmd(0x23);  //粗调对比度，可设置范围0x20～0x27
	lcd_wr_cmd(0x81);  //微调对比度
    if(dev_type == DEV_TYPE_2)
        lcd_wr_cmd(0x2a);  //0x2a,微调对比度的值，可设置范围0x00～0x3f ---> for 6按键界面  091 uc1701x
    else
    if(dev_type == DEV_TYPE_1)
        lcd_wr_cmd(0x1a);//0x1a,微调对比度的值，可设置范围0x00～0x3f  ---> for 5按键界面 573 st7565r
	lcd_wr_cmd(0xa2);  //1/9偏压比（bias）
	lcd_wr_cmd(0xc8);  //行扫描顺序：从上到下
	lcd_wr_cmd(0xa0);  //列扫描顺序：从左到右
	lcd_wr_cmd(0x40);  //起始行：第一行开始
	lcd_wr_cmd(0xaf);  //开显示
}

/*
********************************************************************************
函数名称：lcd_re_init
函数描述：lcd重新初始化
参数描述：
返回值	：
********************************************************************************
*/
void lcd_re_init(void)
{	
	lcd_wr_cmd(0xe2);	//软复位
    /*
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	lcd_wr_cmd(0x2c);  //升压步聚1
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();	
	lcd_wr_cmd(0x2e);  //升压步聚2
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	lcd_wr_cmd(0x2f);  //升压步聚3
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
    */
	lcd_wr_cmd(0x23);  //粗调对比度，可设置范围0x20～0x27
	lcd_wr_cmd(0x81);  //微调对比度
    if(dev_type == DEV_TYPE_2)
        lcd_wr_cmd(0x2a);  //0x2a,微调对比度的值，可设置范围0x00～0x3f ---> for 6按键界面 091 uc1701x
    else
    if(dev_type == DEV_TYPE_1)
        lcd_wr_cmd(0x1a);//0x1a,微调对比度的值，可设置范围0x00～0x3f  ---> for 5按键界面 573 st7565r
	lcd_wr_cmd(0xa2);  //1/9偏压比（bias）
	lcd_wr_cmd(0xc8);  //行扫描顺序：从上到下
	lcd_wr_cmd(0xa0);  //列扫描顺序：从左到右
	lcd_wr_cmd(0x40);  //起始行：第一行开始
	lcd_wr_cmd(0xaf);  //开显示
}

/*
********************************************************************************
函数名称：lcd_reset
函数描述：lcd复位
参数描述：
返回值	：
********************************************************************************
*/
void lcd_reset(void)
{
	LCD_RST_H;
	LCD_RST_L;
	delay_xms(1);
	LCD_RST_H;	
	delay_xms(10);
}

/*
********************************************************************************
函数名称：lcd_wr_byte
函数描述：lcd写字节，时序待测，太快可以加nop
参数描述：
返回值	：
********************************************************************************
*/
void lcd_wr_byte(uint8_t val)
{
	uint8_t i;
	
	for(i = 8; i > 0; i--)
	{
		LCD_SCK_L;	
		__nop();
		
		if(val & 0x80)
			LCD_DI_H;
		else
			LCD_DI_L;
		
		val <<= 1;
		
		LCD_SCK_H;
		__nop();
		//__nop();
	}
}

/*
********************************************************************************
函数名称：lcd_wr_cmd
函数描述：lcd写命令，时序待测，太快可以加nop
参数描述：
返回值	：
********************************************************************************
*/
void lcd_wr_cmd(uint8_t cmd)
{
	LCD_CS_L;
	__nop();
	//__nop();
	LCD_A0_L;
	
	__nop();
	lcd_wr_byte(cmd);
	
	__nop();
	LCD_CS_H;
	__nop();
	LCD_A0_H;
}

/*
********************************************************************************
函数名称：lcd_wr_data
函数描述：lcd写数据，时序待测，太快可以加nop
参数描述：
返回值	：
********************************************************************************
*/
void lcd_wr_data(uint8_t data)
{
	LCD_CS_L;
	__nop();
	//__nop();
	LCD_A0_H;
	
	__nop();
	lcd_wr_byte(data);
	
	__nop();
	LCD_CS_H;
	__nop();
	LCD_A0_H;
}
