/*
********************************************************************************
文件名	：mcb_ru.c
文件描述：主控板远程升级模块
建立人	：杨瑞军
建立日期：2016.12.15
修改内容：
修改人	：
修改日期：
********************************************************************************
*/

#define __MCB_RU_GLOBAL
#include "mcb_ru.h"    
#include "crc.h"  
#include "ymodem.h"     
#include "flash.h"           


/*
********************************************************************************
函数名称：mcb_ru_init
函数描述：主控板远程升级初始化
参数描述：
返回值	：
********************************************************************************
*/
void mcb_ru_init(void) 
{

	mcb_ru_task_flag = 0;
	ymodem_init();
}

/*
********************************************************************************
函数名称：mcb_ru_task
函数描述：主控板远程升级任务
参数描述：
返回值	：
********************************************************************************
*/
void mcb_ru_task(void) 
{
	mcb_ru_task_flag = 0;

}
